{"posts":[{"title":"some usual mistakes when using hexo markdown.","text":"1. markdown原生语法 上标号^不可用 2. LaTeX语法 \\textbf、\\bold、\\left \\right标签不可使用 使用\\\\进行换行时，需要使用\\\\\\\\进行转义。 类似的还有% -&gt; \\\\% 传统暴力大括号写法\\left \\{ \\right.无法渲染，需要用\\begin{cases} \\ends{cases}进行标准处理。","link":"/2025/04/02/some-usual-mistakes-when-using-hexo-markdown/"},{"title":"how-to-commit-a-send-nsfw-content-in-qq","text":"如何优雅地在qq群聊中发涩图吞消息检测当你的消息（任何消息都算，包括涩图）发不出来、被吞时，可以用以下两种方式判断： 文件无法上传，错误代码-143 （较少见） 这种就是被藤子审核第一层就给拦下来了，它会立即提醒你发送失败。 我们常见的红色感叹号： 就是指这种情况。 （仅限手机） 长按该图片消息，无法回复/引用。（用得最多） 这是目前最标准的检测方式，原理是消息通过了藤子的第一道审核，但是没有过第二道审核时，就会是这个状态。藤子的第二道审核原理其实也很简单，基本可以确定是一种hash+视觉模型识别的混合算法，其中视觉模型识别较慢，会在你图片成功发出不久后给你和谐掉。其中违规内容hash表目前推测会定期从pixiv、fantia、EHentai等公开插画网站上搜集r18插画并更新，从而导致很多著名下海画师（如ほうき星、儒宅、YENI、Kacyu|卡丘等）的最新r18插画无法不做处理直接发出。视觉识别模型目前推测是一种上亿参数的模型，因此审核时间长（但是一般肯定会审一遍，你可以相信藤子的算力资源量）。 绕开审核目前来看，这个识别模型是没办法绕开的，基本就是涩图发不出来、发出来的不涩，跟你人脑识别结果差不多了，你觉得过不了审的一般它都会和谐，只不过它比较慢，你发的涩图可以活个几分钟，几分钟后还是得没。 hash表因为模型简单，可以用以下几种方式绕开： 修改涩图像素。 这是最常用、最保真、最简单的方式，原理是更改图片的细节像素，从而改变图片的hash值或一些特征绕过审核。 但是这招也很容易失灵，倒不是因为这招不好用，而是要用好。 （当然，如果你具有计算机视觉、图像识别的实战经验，相信这难不倒你） 比如，图片hash可能会首先把图片像素进行归一化处理，所以图片缩放、调整亮度、对比度、饱和度可能是不太好使的； 通过修改图片格式（.jpg, .png, .jpeg, .webp, ...）等也是不好使的。 进行图片的裁剪、图片小部分像素的修改是可以的，进行图片的旋转、镜像、拓宽等也是可以的。 转发聊天记录 藤子的审核是不管单独聊天的，所以你可以发给你的hxd、你的小号等，然后转为聊天记录发出来。 需要注意的是，聊天记录也是会被吞的，如果聊天记录被吞，就需要将对每个涩图消息发一条回复/引用消息，然后用这个引用消息来代替原来被吞的聊天记录中的涩图消息。具体操作就像这样：原聊天记录：修改后聊天记录： 接下来的就是比较强的绕开方式，但是直观性很差，只能保证你的涩图能共享，不保证能直接看： 发链接这招不仅对涩图管用，对视频、轻小说等所有nsfw内容都管用。 需要注意链接的时效性，百度网盘是出了名的审查严格、秋后算账，其他如蓝奏云、夸克、迅雷云盘（注意，仅限云盘）等都可以 与之相比，磁链（一种基于BitTorrent协议的文件共享链接）就有较长的生命周期，但是速度慢。注意，不要用迅雷下载磁链资源。 加密（压缩包等） 需要注意，压缩包要有密码，不然也绕不开，可以把用移位密码加密的密码写到文件名里面。 图片隐写 你可以发一个打了码的.png格式图片，然后把它的完整版附到后面。制作隐写很简单，windows下使用 1copy /B file1+file2 new_file 就可以在file1的后面加上file2，并放到new_file中。linux下使用 1cat file1 file2 &gt; new_file 读取就会稍显麻烦点，因为要利用.png的格式来判断file1的终点：读取隐写内容的python代码","link":"/2025/04/27/how-to-commit-a-send-nsfw-content-in-qq/"},{"title":"一个平常的故事","text":"一个平常的故事1在一个普通的县城，有一个普通的小学，但是今天，有两个小孩子被请家长了。 “……您看看这张卷子，这种阅读题，我们平时一直都在做这类题型的训练……”一位语文老师用她的手指在试卷上不断地画靶子。每一处被指出的地方，都被老师打了一个大大的问号。在给主观题打分时，老师们通常喜欢用一个红色的问号，来彰显答案的荒谬，这往往比一个大大的红叉更有深意。旁边坐了两位家长，他们的眼神像狙击枪的激光瞄准线，紧紧地跟随着老师所指的地方，脸色凝重。办公桌的另一头还站着两个背着手的孩子，一个是我，一个是我的hxd。 “今晚没戏了。”我沮丧地跟hxd说道，心里满是愧疚，毕竟昨天考试之前说好了，今天回去玩游戏。hxd耸了耸肩，笑道：“没事，下次再说吧。”殊不知，他的眉宇出卖了他：眉间的哀伤，以及眼里闪过的那一丝失望与郁闷，都被我捕捉到了。 我站在原地，面前老师唾沫横飞的分析我一点也没听进去，呆呆地看着红色的批注比蓝黑色的答案还多的试卷，失落与忧虑，交织在我的心头。高年级了，这种考试可是越来越多啊。听说六年级的同学一周一小考、一月一大考，而且期末考也会更加重要，可能会影响整个假期的安排！想到这儿，我不禁打了个寒颤。 这样下去可不是办法……意识到以后可能再也没法跟hxd一起玩某国产fps游戏的我，感受到一股危机感、末日感、窒息感扑面而来。我仿佛看到，我正在失去一种非常重要的东西，比父母的拥抱、老师的肯定、同龄人的倾慕、班上最好看的女生、快餐店里的汉堡更珍贵的东西。 不，这不是失去，这是被夺走！“不行！这样下去没下次了！”我突然对着hxd说道，声音很小，但是一字一顿地。hxd认真思索着我的话，似懂非懂。 回到家，天色已经黑了。吃完晚饭后，我没有像前几次那样恳求父母给我开电脑，而是轻轻地向他们说：“今天老师说的东西，我想强化一下。”父母很诧异，也很高兴，三下五除二地把饭桌擦得干干净净，接着我拿出教材，脑海里浮现出主科老师们都说烂了的教诲：“多听、多说、多读、多写”“要多做题，做时要想，做完要改，改了要总结，总结了要整理，题型千万变，公式不会变”“铃儿响叮当你们别只会jengle bell, jengle bell, jengle all the way那一句”…… 复习完了之后，我想起坐全班第一排靠门位置的班长，他的笔记，在教师的投影仪上看了无数遍，字迹工整、条理清晰、一目了然。我第一次发现有些东西，再怎么忽视也不会忘掉的，就像游戏里的枪，对枪被杀一次我就记住了，今后我都会认得。 2愉快的暑假总是过得飞快。转眼间，下个学期开学了，班上没什么大的变化。只是我的书包，除了常规的语数英教材外，多背了一本破了皮的《史记》、一本写满了的小学奥数教程、一本全是折痕的《了不起的盖茨比》英文原著。 开学第一节数学课。“值日生，上课！”“哐啷哐啷（桌椅碰撞的声音）……老！师！好！”“请坐！”“哐啷哐啷……” 其他同学开始从书包里面掏出数学课本，唯独我，桌上很干净，只有一个小本子、一个文具盒。 老师环视一周，目光落到我身上：“你书呢？”“没事，负数和百分数对吧，我会。”老师微微一笑，我也微微一笑，他为什么笑我不知道，但是我笑是因为昨晚我把书看完了，还把前三章的题做了。而根据不成文规定，老师上课不会出习题集上的题，所以他只能出课本上的题以及现场出题。课本上的题我已经做完了而且记在心里了，现场题只需要一盒文具一张本子就足够了。至于记笔记，负数和百分数有什么好记的？ 不出意外，新学期第一课的课程总是简单的，作业也是简单的。于是下课后我就把作业做了，还往后做了好几篇，看来接下来一段时间我都不用写数学作业了。 接下来是语文课。由于没买教材全解提前预知老师的问题，所以算是有趣。至于英语课，整篇课文就那么几句话我叽里咕噜几下就背完了，单词也早就提前背好了。 课间hxd照常跟我聊起这游戏的新装备，我一脸懵逼，表示不知道。 “你暑假没玩？哦对，你好像一个暑假都没上线来着……”hxd挠了挠后脑勺，“那算了，我找别人聊去。”他正要转头，我拦住他，说道：“没事，等放寒假，我考好点，咱俩再玩。”hxd却回答道：“这可不行，每周任务你得打啊，不然新武器你拿不到，到时候再搞就要充钱了，况且官方之前才对武器做了调整，到时候手生了不得被暴打……” “没事的，你没有，我也没有，咱们一样玩。” “那可不行啊，万一中间出了个绝版了怎么办，我要是不拿岂不是亏麻了。” 我心头一紧，他妈的是挺亏啊！绝版武器的账号现在有人出高价买都买不到，同学之间更是鲜有看到，基本只有技术佬+肝帝才弄得到，搞到一个能吹一辈子。但是，一想到以后可能永远也玩不了，我跟他说：“那我也得先搞一下吧，这后面考试越来越多，考得差，我线都上不了，更拿不了绝版武器了。”hxd只好长叹一口气：“唉，还是我妈比较好，你家管得真够严的。” 3由于父母都是本科生，我在六年级那会儿，就被他们教会了二元一次方程、实数、函数等代数学概念。所以数学我学得非常轻松。不过我家的规矩没有变，考好了才有游戏玩，考差了免谈。至于游戏，我更是换了又换，从端游转战手游了，但是非常苦闷的是，我的手机是装着塞班系统的直板按键诺基亚手机，我爸妈才有Android系统的触屏手机，在那里我才能玩联机手游。 有一次，班上的同学周末聚会，中午吃完饭，我们就跑去一家咖啡馆。那会儿咖啡挺贵的，动辄二十多。当时出来玩我也没想到他们会往这种地方跑，以为他们会跟我爸一样，带着我去满城地找羽毛球网、乒乓球桌、篮球场。我以为他们会跟我的某些素质不太高的球友一样，跑去砸别人场子，然后把球场据为己有，或者跟我爸一样，跑一圈没有空场子就会拉着我跑到周围的山上，登一圈山回去吃饭，路上跟我讲他在各路盗墓小说里面看到的古灵精怪的玩意儿以及神秘的曲边梯形面积计算方法（这我真听不懂）。说实话，那是我人生第一次进公共的室内娱乐场所。 大家各自点了喝的，就打开某国产moba手游开始5排上分。我呢，没有设备，只有一个塞班系统棒槌手机，还没流量，只好看着他们玩。过了一会儿，我觉着看他们玩有点无聊，只好跑到旁边的小包间里，从包里掏出签字笔、草稿纸、一套卷子，开始刷题。 时间差不多了，大家准备回家吃饭。路上他们谈论着今天下午遇到的各种棘手的局势、精妙的操作，本来应该对英雄技能、装备的各项数值、效果、机制、特性了如指掌的我，却插不上话。仔细一盘算，距离我上次玩手机游戏，已经有一个多月了，新游戏、新装备、版本调整，我都不知道，更别提游戏理解了，我那套已经过时了。望着大家口若悬河、滔滔不绝的讨论，我突然想起来，hxd呢？怎么没有叫他一起？那个班上曾经打fps游戏打得最好的男人，他不至于对moba游戏毫无兴趣吧？ 4下周一上学，我在早上第一节课下课就找到hxd：“上周我们出去玩了，你怎么没来呢？他们约好五排上分没叫你吗？” 他一脸沮丧：“没办法啊！我爸妈不给我买触屏手机，说我成绩好了再给我买。”在他说话的时候，我瞥了一眼他的课桌，上面多了三本以前他绝对不会带的书：阅读专项训练、算数天天练、英语词汇，只不过这三本一本比一本新，还有一本封都没拆。 我愕然了，迷迷糊糊地说道：“没事，等你成绩上去了、你妈给你配手机了就好了……” 回家之后，我回想起那个不愉快的周末，跟爸妈大发脾气：“你们知不知道，现在我跟他们之间都不知道说什么！他们聊局势，聊技能，聊机制，聊手法，聊出装，聊运营，我完全插不上嘴！你们知不知道，他们段位已经到钻石了，我还在青铜！我需要大量的游戏时间来上分！而你们，连一部手机都不给我！”爸妈依然和往常一样，说什么“那都是考不上大学的烂孩子”“家里经济条件有限，现在没那么多钱给你买那么好的手机”“等你考个第一，我们会给你买的”，我听了之后，更加生气了，直接踹开屋门，扬长而去，在马路边光秃秃的银杏树下蜷缩着一直哭到了深夜。 我喝不起咖啡、开不起体育俱乐部的会员、充不起游戏、买不起玩具、去不起网吧、用不起触屏手机，这些我都能接受，因为我穷、我家穷。但是没关系，我用得起电脑，我父亲认识一位开电脑维修铺的叔叔，他经常有一些卖不出去的零件，几块钱随手卖给我爸；我有一位hxd，只要他在，我们就能一直联机玩某国产fps游戏，对阵、合作、生化……我们能玩一辈子。但是，如今考试分数这道城墙横在我跟他之间、我跟班上众多同学之间，我们没法去玩电脑、去竞技、去上分、去研究游戏。 我必须跨过这道墙，在我跨过去之前，什么委屈我都能忍受。只要跨过了，我就能继续玩电脑了，一切都能回来。对，只要考好就行了。 5时间又过了几周，转眼到了期末考试。我照常考试，只是做完后发现，这次语文的文言文我读到过！还有数学的附加题我做出来了！以及英语，这次的作文题材我在一些英文小说里读到过类似的文段。所以考完之后，我压抑不住兴奋，又蹦又跳，其他人看到我莫名用一种恐惧的目光看着我，毕竟期末考试考完还能笑出来的人，基本上要让他们的排名下降一位了。 过了两天出成绩了，跟我的预感相符，这次数学我考了满分，而且考了全班第一，年级第4。 出分那天我兴奋极了，我迫不及待地找到hxd，双手紧紧捏住他的肩膀，玩儿命地前后摇摆，用一种近乎癫狂的语气说；“我考第一了！我能玩电脑了！我考第一了！我能玩电脑了！我考第一了！我能玩电脑了！……”老师也为我高兴，没有拦着我；周围本来懊恼沮丧的气氛被我活跃了起来，同学们也开始笑了，有的开始为我喝彩。 然而，已经快被我摇晕的hxd甩开我的手，哭笑不得地跟我诉说：“我玩不了啊，我考砸了。”我一愣，但是马上拍拍他说：“那你来我家玩！或者我们去电脑店拼两台电脑，我们去外面玩！某国产fps玩不了，我们还可以玩一些简单的局域网联机……”他打断我说：“算了，我爸妈给我报了寒假班，晚上吧，晚上我陪你玩。”我爽快地答应：“好啊，那就晚上！” 但是，在这个不怎么下雪的寒假，在这个小学六年级上学期期末结束后的寒假当中，至少在春节之前，我没看到他上过哪怕一次线。 6不过找不到玩伴的不快很快被过年的氛围所掩盖，毕竟谁会跟各种年货、超市里面喜庆的装饰、街上的灯笼、电视里各种节目过不去呢？父亲也关门了，我们一起出去打球、登山、到山顶看雪（只能看，玩是玩不了一点，气温不够低，一摸就化）、窝在家里看电影。父亲买了个硬盘播放器，拿USB从磁链上下载各路免费电影资源，我们看了个爽。 我的两个伯父此时都买了车，我们还会一起坐车回到我父亲像我这么大的时候住的地方，探亲、上坟、打扫祖坟。因为祖坟有点远一年只能回一次，所以干脆春节清明节一起过了。这时爷爷奶奶会穿得厚厚的，跟企鹅一样，兜里穿着不少糖，啥样的都有，每次都有我没吃过的。 不得不说，烧纸真的很好玩，糖也很好吃，电影也很好看，雪也很洁白，大伯的开车歌单很有品味。只是吃饭时看到比我小两岁的侄子在玩某国产moba手游时，我时常在想，此时远方的hxd一定也跟他一样，好吃好喝好玩吧，他家的经济条件不错，买得起Android手机，过年了还是能给他玩的。 然而我的思绪被舅妈的话语打断： “儿子，你跟你表叔学学，人家虽然只大你两岁，但是人家刚考了全班第一呢！你都玩多久的手机了，向你表叔请教一下你学习上遇到的问题吧，人家可是妥妥的学霸呢！” 我立马调转思绪。啊？我考个第一就成学霸了？原来当学霸这么简单的么？ “啊……我……我哪儿是学霸啊，我离学霸还差得远呢……”我一边回应着，一边挠着脑袋腼腆地别过头去。我的班长，全班学习最好的人，笔记被全班传阅，名字在老师开会时此起彼伏。没有他不会做的题，没有他写不出来的命题作文，没有他不认识的单词与短语。 他是全班极为罕有的、能拿着粉笔站在黑板前并让老师主动滚到一边给他擦黑板的人。那才是学霸。我又想起老师的话语：“你要是能自己站到讲台上去，让我们这些当老师的老老实实坐在下面听，那我们自然就不会管你了。” 想到这里，我正着脸，回应舅妈：“学霸应该是能站到讲台上讲课、让老师滚去下面听课的学生！”舅妈听完一愣，周围的亲戚听到我的话也如宕机一般停止了话题。 “嚯，你个小娃儿敢这么对你老师？” “所以我不是学霸，我班长是。” 一旁大伯眼见气氛不对，打趣到：“你莫这样，人家说的也没错……你小子说得对，能让你的老师坐下面听你讲课，那说明你学得比你老师还好，那是真的有本事。”说完，拿起自己的酒杯，一饮而尽。很快，劝酒、添酒的声音又填满了整个饭桌，大家继续吃吃喝喝。 那天夜里，我比所有人都期待能早点回家，为了早点去做作业。至于打游戏，就先放一边吧，我要把老师赶下讲台。 7转眼开学了，当莘莘学子背着书包进入校园，我在其中比任何其他人都兴奋、激动。 课堂上喜欢举手的学生，多了一个人，那就是我。我很喜欢数学课，因为我发现数学课老师时常有笔误，往常大多数时候会被班长发现纠正，我们就在下面简单地笑笑，但是这学期不一样了，在老师书写板书时，我死死地跟着老师的解题思路，没有一点的走神与掉队，只要他刚写错一个字母，我就会立马指出；在数学课上，我听得比任何人都认真，包括班长；在老师书写习题时，我疯狂地想要算得快一点，恨不得老师刚把题写完我就算出答案。 我开始追求严密的解题逻辑、更为精巧的解题思路、更为极限的解题速度。我恨不得看完每一道题我就能算出答案，恨不得在考试时一拿到试卷就开始奋笔疾书。我开始喜欢下课后往老师办公室跑，他在的时候我就甩个难题给他，他不在我就偷偷地翻他的办公桌，看看他会哪些东西、藏着掖着什么公式、在做什么习题册。 我能够孜孜不倦地看枯燥的奥数教程，主动购买希望杯、华罗庚金杯等数学竞赛的赛题。我开始找班长，找班上、年级上其他数学比较好的同学，我们一起做竞赛题，苦思冥想，讨论思路。 眼睛里面没有对老师的尊敬，全是对难题求解的渴望。 终于有一次考试，我不仅做出了附加题，还给出了一个新的解法，老师让我上去讲。那一刻，我的心脏在跳动。拿着粉笔叽里咕噜快速地把解题思路拉了一遍，然后回到座位上，看着老师哭笑不得地把我凌乱的草稿整理成工整的解题过程。 显然，把老师赶下讲台不是那么容易的事，我需要去解决更难的问题，向他们展露更亮眼的才华。 时间来到端午节，几个同学拉着我出去玩，很显然，他们打算5排上分，我犹豫了。但是一想到努力学习不就是为了玩游戏，我还是爽快地答应了，这次我父亲同意交换我俩的手机，他用一天的塞班，我用一天的安卓，只是叫我早点回来吃饭。 这次我们选了一个小茶馆，6元一杯的菊花茶我终于是消费得起了。但是一打开游戏，一个大大的回归界面崩在我面前。 “不是，你怎么都触发回归奖励了？你多久没上线了？”一个头发较长但是较为凌乱的同学凑到了我的脸上。 “无所谓，能打就行。”我关掉弹窗，点击排位。一看，嗯，青铜，不过也合理，我都一直没怎么打。 “让我看看你的ID……啥子玩意儿？青铜3？”一个带着鸭舌帽的同学本来打算凑过来加我好友，结果看到我的段位震惊了。 “哈哈哈，不行让我笑会儿，哈哈哈哈……老子才玩不到几天的小号都白银1了，哈哈哈哈哈……”那位头发凌乱的同学蚌埠住了，直接向后面的沙发倒去，笑得四仰八叉。旁边几个同学听到了也破口大笑，甚至有人指着我笑，我看着他不加任何掩饰的嘲笑，心里突然有点不舒服。 “不是你怎么这么菜啊……”“这上个锤子分，青铜段位啥意识啥理解啥操作那还用说吗……”“你tm记得清楚出装吗，怕是上去对线跟狗一样被人家打得缩在塔下出不来，哈哈哈哈哈……” “那一起上分……”我想转移话题，但被打断，“上个锤子分，他铂金1，他铂金3，他黄金1，这儿最差都有个白银，打个毛线啊，铂金局跟青铜狗一个房间？哈哈哈哈哈……” “这样吧，你送我一瓶可乐，叫一声爸爸，我当你师父，带一带你，你还别嫌弃，好多人给钱让我带他我都不带。”那个带着鸭舌帽的同学似乎特别乐意看到我被踩在脚下。 “要不你先去跟人机练练吧，别鸡吧人机都打不过，拉你进房间还不如塞两个人机。”那个段位最高的星耀1同学发话了。 想想也是，我这段位进去只能被暴打的。“行吧，你们玩，我走了。”感觉有点不太舒服的我揣上手机出了包间。关上门的时候听到：“我还给他优惠了，换成一般人不仅叫爸爸还要帮我把教室卫生做了……”我依然是找了个包间，拿出卷子，开始刷题，但是这次我脑中浮现了爸妈的话：“那是一群考不上大学的烂孩子。” 8“……不是，你他妈怎么这么笨啊，你爸我都他妈这么给你掰碎了揉碎了讲，你他妈还不会，你他妈脑子被狗吃了吗？” 一个女生正拿着一本练习册，询问着一位同班男生，希望他给她讲讲什么是开根。她梳着漂亮的大马尾，但是很不幸，这位男生似乎并没有怜香惜玉的品德，同样也不幸的是，这个三句不离妈、出口成脏的男生，是初中一年级的我。 我不耐烦地把她的作业题单扔向她的胸口，卷子在空中打卷，翻飞一转后，掉在了地上，女生弯腰去捡，不过她似乎也没有多么沮丧，而是转头去找了另一个男生，毕竟从我这里应该是得不到答案了。 晚自习的上课铃响起，嘈杂的教室依然久久没法平静。直到值班老师来到讲台上，教室才安静。 4科作业全都写完的我，开始找题做。当时比较热门的，有《中考必备》，这是真题卷；也有像《天府数学》《中等数学》等课外数学丛书，其中《天府数学》还有专门的高难度题册，难上加难。 第二天早晨，早上6:30，宿舍开始亮灯，当别人还在迷迷糊糊地睁眼时，我直接从上铺利索地穿好衣服爬下来，去水池接水把手打湿，然后直接往下铺同学的脸上抹去： “起来！给老子交作业！” 紧接着，我拿着同样湿润的手，转向其他几个没交作业的同学。有几个在隔壁宿舍，那也拦不住我，我踹开房门就是一阵闹腾，挨个挨个抹脸，直到他们从床上起来为止。 “你再碰老子小心老子给你两下！”“怎么，你他妈的是想拒交作业？”“……”“那就给老子快点起来！” 等我做完内务，我跑到食堂，吃完小米粥和包子就迅速跑到教室催昨天没交数学作业的女生。 “写完了吗？没写完快给老子写！”我几乎会对每个没交作业的女生这样吼一下。 我看着花名册，确认全部都催了一遍之后，掏出书本，准备早读。 语文老师，同时也是班主任，来了，于是大家纷纷拿起书本，开始整齐地念书。 早读结束后，一般有10分钟时间，在这十分钟时间内，课代表会把前一天的作业，连着名单，一起抱到老师的办公室。其中名单上没有的学生，上课的时候八成会被赶到教室外面站着。 正常来讲，如果缺交太多，课代表也得出去站着，但是我是个例外，因为我同是还是设备管理员，老师需要我来辅助他搞投影仪、开电脑之类的。所以我约等于有两个课桌，设备柜上时常堆放着我的东西。 数学课到了，几个学生很自觉地到外面站着了。数学课结束，他们回到教室里，参与到课间的闲聊。 “我真是日了狗了，上周周日我打了半天，赢一把输一把赢一把输一把，死活打不上去……”“最近猴好像出新皮肤了，好像是猴年限定，今年过了要等他妈的十二年。”说着说着，还有人急眼了：“上周就你他妈的给对面射手送了5个头！团战你妈的打得跟个狗屎一样！老子大招转好了的，你他妈的在虚啥子！……” 我想上个厕所，从过道里往外挤。 “唉，这儿……这人，这人更是牛批，青铜3，日妈我们整个学校估计都找不到几个青铜狗，真的，我们班居然有一个，噗哈哈哈哈哈……”一个头发略有些蓬松的同学看我从他旁边经过，立刻将我指向他的几个兄弟，众人立马停止话题，开始指着我的鼻子哈哈大笑。 “滚你妈批，老子看你是皮痒了想被打了是不是。”我立马怼了回去。 “那对啊，这周1v1单挑来不来，老子拿daji都打得过你。不对，我记得你好像连手机都没得吧，哈哈哈哈……”说到这，周围一群学生都跟着凑了过来。“他跟你打？他号上啥都没有，一个一万三的都没得，更别提一万八的。我他妈刚刚开耍的时候都买了十几个英雄，这人直接拿起yase daji anqila跑去打匹配，把把被对面举报，打得还不如人机，哈哈哈哈哈……” 我正想跟他们掰扯，他们突然开始说到：“不服是吧，不服来1v1啊！你想怎么ban、怎么选都可以，别鸡吧被我打输了对着手机哭稀了就行。”“1v1都不敢打的人还他娘的在这儿丢人现眼是吧？”“来不来打1v1？”…… 我瞬间冷静，邪魅一笑：“明天你想挨几鞭子？”站我跟前的家伙瞬间眉头紧锁，开始马脸：“唉，我草他娘的，日妈这人就喜欢这样。”“就是，真把自己当上边老师了……” 在这个班上，老师宁愿相信一个成绩好的、表现地单纯、还经常跟自己打交道的学生的随口一说，也不愿意相信一个成绩差的、经常撒谎翘课的学生的辩解。 “你们应该庆幸你们在国内读书。在国外，学校还有校警。”这是我见多识广的数学老师，在一次发脾气之后，随口说的话。 9（没完没了，hxd暂时下线了，剩下的明天写吧）","link":"/2025/11/14/a-normal-story/"},{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2025/12/05/hello-world/"},{"title":"how to gain 70 5-star objects before 2-year commemoration of HSR.","text":"论从开服到“星穹贺礼”活动结束，大概需要氪多少钱才能有70个金p1. 计算方法众所周知，氪金是为了抽卡，所以我们只考虑抽卡氪金。 那么有两个方向来降低氪金数额，一种是减少总抽数，一种是尽可能采用高性价比的抽卡资源购买方式。 第一种方向，理论上讲总抽数可以减少到69抽（一抽一个金，外加送的真理医生），但是这种概率不到${10^{-6}}$，因此不加限制的理论最小值在这里毫无意义。考虑到大数定律以及中心极限定理，我们直接用光锥期望代替，将总抽数固定下来。 第二种方向，在总抽数固定下来后，我们只考虑如何用最少的钱换取最多的票。那么显然，通票是会算进来的，全图鉴是假设成立的，游玩的时间是不计的，操作的繁琐是忽略的——我们会算入所有可免费获取票，然后，根据票数与价格的比例，我们将所有充值行为分为若干档，从最低档开始充值，如果最低档充不了了（比如月卡最多只能买731天），就会买下一档，以此类推，直到票数达到总抽数。**** 0.结论（大伙想看的） 种类 抽数 花费 白嫖 $2336.94$ $¥0$ 小月卡 $458$ $¥750$ 首充 $490.5$ $¥3924$ 大月卡（¥128） $243$ $¥2304$ 普通648 $606$ $¥7776$ 总计 $\\textbf{4134.44}$（所需：$4105$） $¥\\textbf{14454}$ 也就是说，你从开服那天开始玩，在榨干所有游戏内可获取抽卡资源，薅光各大平台的免费签到、网页小活动，全勤大小月卡，清光3次首充之后，再充12个648，就可以拿到这次的星穹贺礼。总计大概只需要$14454$元。 1. 总抽数（账号上70金，要抽多少抽）根据b站up主一颗平衡树的《用1500万抽暴力破解星穹铁道抽卡系统》$^{[1]}$公布的——我称之为——基础概率递增的抽卡模型，我做了如下研究： 1.0 期望公示（看不懂的看这个就行） 种类 期望 五星角色 $62.30$ 限定五星角色 $89.46$ 五星光锥 $\\textbf{53.41}$ 限定五星光锥 65.11 1.1 模型建立根据视频所言，星穹铁道的卡池可以简化为如下模型： 玩家每次抽卡，其抽卡结果可以看做一个随机变量$X$，服从0/1分布，即$X \\sim B(1, p)$。 取值 $0$ $1$ 概率 $p$ $1-p$ 考虑一直抽一直抽，直到抽出金所需的抽数$Y$，很明显，$Y$也是个随机变量。若$p$不变，那么$Y$的服从离散型指数分布：$$ P(Y=k) = (1-p)^{k-1}p, k \\in N_+ $$考虑前缀和，即$P(Y \\leq k)$，则：$$ P(Y \\leq k) = \\sum \\limits_{j=1}^{k}P(Y=j)$$取$p=0.016$（角色池五星公示概率），画出来长这样：可以看到，此时仍会有$23.4%$的玩家无法在90抽内出金，于是加入了保底机制，实现方式为从第某抽开始，基础概率$p$随着抽数的增加而增加，并确保在保底抽数之前增长到$1$。$$ p = p(i) = \\begin{cases}p_0, &amp; i &lt; s \\\\\\min ( p_0 + ( i-s ) \\times a, 1), &amp; i \\geq s\\end{cases} $$代入一棵平衡树所示的参数，就有如下分布：期望结果与一棵平衡树算出的结果相同，此处略。 1.2 70总抽数估计由于真理医生被赠送，所以我们只需要抽69金。在拥有以上概率模型之后，我们就好办了。 我们考虑抽N抽出69金的概率分布： 为了保证普适性，想抽69金出来，在角色池或者常驻池需要抽$4744$抽，在光锥池需要抽$4105$抽。 很明显的，我们all in光锥池，所需抽数最少。于是总抽数便定为$\\textbf{4105}$抽。 2. 抽卡价位可获取的抽卡资源，价位从低到高排序： 种类 价位（¥/抽） 白嫖 $0$ 小月卡 $1.6$ 首充（6~648各档位） $8$ 大月卡（¥68基础档） $8.5$ 大月卡（¥128档溢出单价） $10.91$ 648 $\\textbf{12.83}$ 328 $13.53$ 198 $14.14$ 98 $14.39$ 30 $14.54$ 6 $16$ 成本最低原则，我们只考虑前5档：白嫖、小月卡、首充、大月卡、普通648。 2.1 白嫖这里简化了一下计算，引用了孤胆飞客的文档《星琼铁道抽卡资源——孤单飞客》$^{[2]}$（数据采集时间2025.3.30）： 专票1785.94，通票551。 为了简化计算，这里直接把通票拿去抽光锥池。 共计$\\textbf{2336.94}$抽。 2.2 小月卡崩铁开服时间为2023年4月26日，该活动截止日期为2025年4月26日，中间相差2年，天数$365 \\times 2 +1 = 731$天，小月卡24张完整的，1张只领了11天的。 合计$ (3000 \\times 24+11 \\times 90+300) \\div 160 = \\textbf{458}$抽，合计$30 \\times 25 = \\textbf{750} $元。 2.2 首充一次首充，$6+30+98+198+328+648=1308$元，对应$163.5$抽。 总共3次首充（3.2开服还会重置一次），共$\\textbf{490.5}$抽，花费$¥\\textbf{3924}$。 2.3 大月卡（¥128档）一张大月卡，总计8张专票，880星琼，合计$13.5$抽。 截止2025年4月26日，崩铁历经18版本（1.0 7个版本，2.0 8个版本，3.0 3个版本）。 故大月卡抽数为$13.5 \\times 18 = \\textbf{243}$抽，花费$18 \\times 128=¥\\textbf{2304}$。 2.4 普通648这里还差$576.56$抽，我们直接充12个648（一个648是50.5抽）。 普通648抽数$50.5 \\times 12 = \\textbf{606}$抽，花费$¥\\textbf{7776}$。 2.5 抽卡总数分析 种类 抽数 花费 白嫖 $2336.94$ $¥0$ 小月卡 $458$ $¥750$ 首充 $490.5$ $¥3924$ 大月卡（¥128） $243$ $¥2304$ 普通648 $606$ $¥7776$ 总计 $\\textbf{4134.44}$（所需：$4105$） $¥\\textbf{14454}$ 3. 这个结果其实算高了因为我忽略了一个很重要的东西：星芒。星芒满600个，可以在商店兑换一个金（比换票划算）。 这个是一个非常大的五星来源，但是这里直接给它忽略了，导致我们在最贵的一档那里买了将近$15 \\%$的抽卡资源，却花了近一半的钱。也就是说哪怕星芒只会节省10%的抽数，我们都可以砍$25 \\%$的总花费。 但是这样的话这个blog更难写了，以后再说吧。 4. 参考文献[1] 一颗平衡树. 用1500万抽暴力破解星穹铁道抽卡系统[OL].哔哩哔哩 [2] 孤胆飞客. 星穹铁道抽卡福利有多少？每版本能抽几个五星？1.0~1.5星琼统计[OL].哔哩哔哩 [3] 孤胆飞客. 星穹铁道抽卡资源统计表[OL]. 腾讯文档","link":"/2025/03/30/how-to-gain-70-5-star-objects-before-2-year-commemoration-of-HSR/"}],"tags":[{"name":"hexo","slug":"hexo","link":"/tags/hexo/"},{"name":"markdown","slug":"markdown","link":"/tags/markdown/"},{"name":"FAQ","slug":"FAQ","link":"/tags/FAQ/"},{"name":"杂项","slug":"杂项","link":"/tags/%E6%9D%82%E9%A1%B9/"},{"name":"逃逸攻击","slug":"逃逸攻击","link":"/tags/%E9%80%83%E9%80%B8%E6%94%BB%E5%87%BB/"},{"name":"故事","slug":"故事","link":"/tags/%E6%95%85%E4%BA%8B/"},{"name":"游戏理解","slug":"游戏理解","link":"/tags/%E6%B8%B8%E6%88%8F%E7%90%86%E8%A7%A3/"},{"name":"基础概率","slug":"基础概率","link":"/tags/%E5%9F%BA%E7%A1%80%E6%A6%82%E7%8E%87/"}],"categories":[],"pages":[]}